Catalogs/ВидыНалоговИПлатежейВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыНалоговИПлатежейВБюджет</Name>
			<Comment>Налоги, взносы и иные платежи в бюджет</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Comment>Заполняется для поставляемых данных</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаКодБыстрогоВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Comment>Служебный реквизит</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаИзменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/УчетДенежныхСредствПовтИсп/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Возвращает все балансовые счета, где присутствует субконто Банковские счета
//
// Параметры:
//
// Возвращаемое значение:
//	СписокСчетов - Массив - массив счетов
//
Функция ПолучитьСчетаССубконтоБанковскиеСчета(СчетаИсключения = Неопределено) Экспорт
	
	СписокСчетов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХозрасчетныйВидыСубконто.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный.ВидыСубконто КАК ХозрасчетныйВидыСубконто
	|ГДЕ
	|	ХозрасчетныйВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.БанковскиеСчета)
	|	И НЕ ХозрасчетныйВидыСубконто.Ссылка.Забалансовый
	|	И НЕ ХозрасчетныйВидыСубконто.Ссылка В (&СчетаИсключения)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка";
	
	Если ЗначениеЗаполнено(СчетаИсключения) Тогда
		Запрос.УстановитьПараметр("СчетаИсключения", БухгалтерскийУчетПовтИсп.СчетаВИерархии(СчетаИсключения));
	Иначе
		Запрос.УстановитьПараметр("СчетаИсключения", Новый Массив);
	КонецЕсли;
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		СписокСчетов = Результат.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(СписокСчетов);
	
КонецФункции

Функция ПолучитьСтатьюДДСПоВидуОперации(ВидОперации) Экспорт
	
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.ПолучитьСтатьюДДСПоВидуОперации(ВидОперации);
	
КонецФункции

Функция ПредопределеннаяСтатьяДДСПоКонтексту(ВидОперации) Экспорт
	
	Возврат Справочники.СтатьиДвиженияДенежныхСредств.ПредопределеннаяСтатьяДДСПоКонтексту(ВидОперации);
	
КонецФункции

Функция СписокБанковСВалютнойВыпиской() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Макет = Обработки.КлиентБанк.ПолучитьМакет("СписокБанковСВалютнойВыпиской");
	Макет.КодЯзыка = Метаданные.Языки.Русский.КодЯзыка;
	
	Возврат Макет;
	
КонецФункции

Функция ТаблицаПоставляемыхДанныхПоВидуНалога(Период, ВидНалога) Экспорт
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("ВидНалога", ВидНалога);
	ТаблицаПоставляемыхДанных =
		Справочники.ВидыНалоговИПлатежейВБюджет.ПрочитатьПоставляемыеДанныеКлассификатора(Период, СтруктураОтбора);
	
	Возврат ТаблицаПоставляемыхДанных;
	
КонецФункции

Функция ТаблицаПоставляемыхДанныхПоКБК(Период, КБК) Экспорт
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("КодБК", КБК);
	ТаблицаПоставляемыхДанных =
		Справочники.ВидыНалоговИПлатежейВБюджет.ПрочитатьПоставляемыеДанныеКлассификатора(Период, СтруктураОтбора);
	
	Возврат ТаблицаПоставляемыхДанных;
	
КонецФункции

Функция ВыделятьНДССКомиссииБанка(Организация, Дата) Экспорт
	
	ПрименяетсяНДССКомиссииБанка = УчетНДСКлиентСервер.ПрименяетсяНДССКомиссииБанка(Дата);
	ПлательщикНДССВычетами = УчетнаяПолитика.ПлательщикНДССВычетами(Организация, Дата);
	
	Результат = ПрименяетсяНДССКомиссииБанка И ПлательщикНДССВычетами;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
